
local eli_advanced_config = {
	[1] = {																
		width = 1,											-- 口
		height = 1,
		blocks = {
			[1] = { x = 0,y = 0 }
		},
		cells = {
			less = {
				[1] = { i = 0,j = 0 }
			},
			equal = {
				[1] = { i = 0,j = 0 }
			},
			more = {
				[1] = { i = 0,j = 0 }
			}
		}
	},
	[2] = {												
		width = 4,											-- 口口口口
		height = 1,
		blocks = {
			[1] = { x = 0,y = 0 },
			[2] = { x = 1,y = 0 },
			[3] = { x = 2,y = 0 },
			[4] = { x = 3,y = 0 }
		},
		cells = {
			less = {
				[1] = { i = 0,j = 0 },
				[2] = { i = 0,j = 1 },
				[3] = { i = 0,j = 2 },
				[4] = { i = 0,j = 3 }
			},
			equal = {
				[1] = { i = 0,j = 0 },
				[2] = { i = 0,j = 1 },
				[3] = { i = 0,j = 2 },
				[4] = { i = 0,j = 3 }
			},
			more = {
				[1] = { i = 0,j = 0 },
				[2] = { i = 0,j = 1 },
				[3] = { i = 0,j = 2 },
				[4] = { i = 0,j = 3 }
			}
		}
	},
	[3] = {
		width = 2.5,										-- 	4口								
		height = 3,											-- 1口---------> first
		blocks = {											--  2口3口
			[1] = { x = 0,   y = 1 },
			[2] = { x = 0.5, y = 0 },
			[3] = { x = 0.5, y = 2 },
			[4] = { x = 1.5, y = 0 }
		},
		cells = {
			less = {
				[1] = { i = 0, j = 0 },
				[2] = { i = -1,j = 0 },
				[3] = { i = -1,j = 1 },
				[4] = { i = 1, j = 1 }
			},
			equal = {
				[1] = { i = 0, j = 0 },
				[2] = { i = -1,j = 0 },
				[3] = { i = -1,j = 1 },
				[4] = { i = 1, j = 0 }
			},
			more = {
				[1] = { i = 0, j = 0 },
				[2] = { i = -1,j = 1 },
				[3] = { i = -1,j = 2 },
				[4] = { i = 1, j = 0 }
			}
		}
	},
	[4] = {
		width = 2.5,										--   		 口4
		height = 3,											--    		  口1
		blocks = {											--        3口口2
			[1] = { x = 1.5, y = 1 },
			[2] = { x = 1,   y = 0 },
			[3] = { x = 0,   y = 0 },
			[4] = { x = 1,   y = 2 }
		},
		cells = {
			less = {
				[1] = { i = 0,  j = 0 },
				[2] = { i = -1, j = -1 },
				[3] = { i = -1, j = -2 },
				[4] = { i = 1,  j = 0 }
			},
			equal = {
				[1] = { i = 0,  j = 0 },
				[2] = { i = -1, j = -1 },
				[3] = { i = -1, j = -2 },
				[4] = { i = 1,  j = -1 }
			},
			more = {
				[1] = { i = 0,  j = 0 },
				[2] = { i = -1, j = 0 },
				[3] = { i = -1, j = -1 },
				[4] = { i = 1,  j = -1 }
			}
		}
	},
	[5] = {
		width = 3,
		height = 2,
		blocks = {
			[1] = { x = 0,   y = 1 },		--       1口  口4
			[2] = { x = 0.5, y = 0 },		--        2口口3
			[3] = { x = 1.5, y = 0 },
			[4] = { x = 2,   y = 1 }
		},
		cells = {
			less = {
				[1] = { i = 0,  j = 0 },
				[2] = { i = -1, j = 0 },
				[3] = { i = -1, j = 1 },
				[4] = { i = 0,  j = 2 }
			},
			equal = {
				[1] = { i = 0,  j = 0 },
				[2] = { i = -1, j = 0 },
				[3] = { i = -1, j = 1 },
				[4] = { i = 0,  j = 2 }
			},
			more = {
				[1] = { i = 0,  j = 0 },
				[2] = { i = -1, j = 1 },
				[3] = { i = -1, j = 2 },
				[4] = { i = 0,  j = 2 }
			}
		}
	},
	[6] = {
		width = 3,
		height = 2,
		blocks = {
			[1] = { x = 0,     y = 0 },      --         2口口3
			[2] = { x = 0.5,   y = 1 },      -- first<-1口  口4
			[3] = { x = 1.5,   y = 1 },
			[4] = { x = 2,     y = 0 }
		},
		cells = {
			less = {
				[1] = { i = 0,  j = 0 },
				[2] = { i = 1,  j = 1 },
				[3] = { i = 1,  j = 2 },
				[4] = { i = 0,  j = 2 }
			},
			equal = {
				[1] = { i = 0,  j = 0 },
				[2] = { i = 1,  j = 0 },
				[3] = { i = 1,  j = 1 },
				[4] = { i = 0,  j = 2 }
			},
			more = {
				[1] = { i = 0,  j = 0 },
				[2] = { i = 1,  j = 0 },
				[3] = { i = 1,  j = 1 },
				[4] = { i = 0,  j = 2 }
			}
		}
	},
	[7] = {
		width = 2.5,
		height = 2,
		blocks = {
			[1] = { x = 0,     y = 0 },		--          3口口4
			[2] = { x = 1,     y = 0 },		-- 		   1口口2
			[3] = { x = 0.5,   y = 1 },
			[4] = { x = 1.5,   y = 1 }
		},
		cells = {
			less = {
				[1] = { i = 0,  j = 0 },
				[2] = { i = 0,  j = 1 },
				[3] = { i = 1,  j = 1 },
				[4] = { i = 1,  j = 2 }
			},
			equal = {
				[1] = { i = 0,  j = 0 },
				[2] = { i = 0,  j = 1 },
				[3] = { i = 1,  j = 0 },
				[4] = { i = 1,  j = 1 }
			},
			more = {
				[1] = { i = 0,  j = 0 },
				[2] = { i = 0,  j = 1 },
				[3] = { i = 1,  j = 0 },
				[4] = { i = 1,  j = 1 }
			}
		}
	},
	[8] = {
		width = 2.5,
		height = 2,
		blocks = {
			[1] = { x = 1.5, y = 0 },		--          4口口3
			[2] = { x = 0.5, y = 0 },		-- 		     2口口1
			[3] = { x = 1,   y = 1 },
			[4] = { x = 0,   y = 1 }
		},
		cells = {
			less = {
				[1] = { i = 0,  j = 0 },
				[2] = { i = 0,  j = -1 },
				[3] = { i = 1,  j = 0 },
				[4] = { i = 1,  j = -1 }
			},
			equal = {
				[1] = { i = 0,  j = 0 },
				[2] = { i = 0,  j = -1 },
				[3] = { i = 1,  j = -1 },
				[4] = { i = 1,  j = -2 }
			},
			more = {
				[1] = { i = 0,  j = 0 },
				[2] = { i = 0,  j = -1 },
				[3] = { i = 1,  j = -1 },
				[4] = { i = 1,  j = -2 }
			}
		}
	},
	[9] = {
		width = 2.5,
		height = 4,
		blocks = {
			[1] = { x = 0,   y = 0 },		--            口4
			[2] = { x = 0.5, y = 1 },		-- 		     口3
			[3] = { x = 1,   y = 2 },		--          口2
			[4] = { x = 1.5, y = 3 }		--         口1
		},
		need_caltype = 1
	},
	[10] = {
		width = 2.5,
		height = 4,
		blocks = {
			[1] = { x = 1.5,   y = 0 },		--       口4   
			[2] = { x = 1,     y = 1 },		-- 		  口3  
			[3] = { x = 0.5,   y = 2 },		--         口2
			[4] = { x = 0,     y = 3 }		--          口1
		},
		need_caltype = 2
	},
	[11] = {
		width = 2,
		height = 3,
		blocks = {
			[1] = { x = 0,   y = 1 },		--           4口
			[2] = { x = 0.5, y = 0 },		-- 		    1口口3
			[3] = { x = 1,   y = 1 },		--           2口
			[4] = { x = 0.5, y = 2 }
		},
		cells = {
			less = {
				[1] = { i = 0,   j = 0 },
				[2] = { i = -1,  j = 0 },
				[3] = { i = 0,   j = 1 },
				[4] = { i = 1,   j = 1 }
			},
			equal = {
				[1] = { i = 0,   j = 0 },
				[2] = { i = -1,  j = 0 },
				[3] = { i = 0,   j = 1 },
				[4] = { i = 1,   j = 0 }
			},
			more = {
				[1] = { i = 0,   j = 0 },
				[2] = { i = -1,  j = 1 },
				[3] = { i = 0,   j = 1 },
				[4] = { i = 1,   j = 0 }
			}
		}
	},
	[12] = {
		width = 2,
		height = 3,
		blocks = {
			[1] = { x = 0.5,   y = 1 },		--          4口口3
			[2] = { x = 0,     y = 0 },		-- 		      口1
			[3] = { x = 1,     y = 2 },		--           口2
			[4] = { x = 0,     y = 2 }
		},
		cells = {
			less = {
				[1] = { i = 0,   j = 0 },
				[2] = { i = -1,  j = -1 },
				[3] = { i = 1,   j = 1 },
				[4] = { i = 1,   j = 0 }
			},
			equal = {
				[1] = { i = 0,   j = 0 },
				[2] = { i = -1,  j = -1 },
				[3] = { i = 1,   j = 0 },
				[4] = { i = 1,   j = -1 }
			},
			more = {
				[1] = { i = 0,   j = 0 },
				[2] = { i = -1,  j = 0 },
				[3] = { i = 1,   j = 0 },
				[4] = { i = 1,   j = -1 }
			}
		}
	},
	[13] = {
		width = 2,
		height = 3,
		blocks = {
			[1] = { x = 0.5,   y = 1 },		--          4口口3
			[2] = { x = 1,     y = 0 },		-- 		      口1
			[3] = { x = 1,     y = 2 },		--             口2
			[4] = { x = 0,     y = 2 }
		},
		cells = {
			less = {
				[1] = { i = 0,   j = 0 },
				[2] = { i = -1,  j = 0 },
				[3] = { i = 1,   j = 1 },
				[4] = { i = 1,   j = 0 }
			},
			equal = {
				[1] = { i = 0,   j = 0 },
				[2] = { i = -1,  j = 0 },
				[3] = { i = 1,   j = 0 },
				[4] = { i = 1,   j = -1 }
			},
			more = {
				[1] = { i = 0,   j = 0 },
				[2] = { i = -1,  j = 1 },
				[3] = { i = 1,   j = 0 },
				[4] = { i = 1,   j = -1 }
			}
		}
	},
	[14] = {
		width = 2,
		height = 3,
		blocks = {
			[1] = { x = 0.5,   y = 1 },		--             口2
			[2] = { x = 1,     y = 2 },		-- 		      口1
			[3] = { x = 0,     y = 0 },		--          3口口4
			[4] = { x = 1,     y = 0 }
		},
		cells = {
			less = {
				[1] = { i = 0,    j = 0 },
				[2] = { i = 1,    j = 1 },
				[3] = { i = -1,   j = -1 },
				[4] = { i = -1,   j = 0 }
			},
			equal = {
				[1] = { i = 0,    j = 0 },
				[2] = { i = 1,    j = 0 },
				[3] = { i = -1,   j = -1 },
				[4] = { i = -1,   j = 0 }
			},
			more = {
				[1] = { i = 0,    j = 0 },
				[2] = { i = 1,    j = 0 },
				[3] = { i = -1,   j = 0 },
				[4] = { i = -1,   j = 1 }
			}
		}
	},
	[15] = {
		width = 2,
		height = 3,
		blocks = {
			[1] = { x = 0.5,   y = 1 },		--           口2
			[2] = { x = 0,     y = 2 },		-- 		      口1
			[3] = { x = 0,     y = 0 },		--          3口口4
			[4] = { x = 1,     y = 0 }
		},
		cells = {
			less = {
				[1] = { i = 0,    j = 0  },
				[2] = { i = 1,    j = 0  },
				[3] = { i = -1,   j = -1 },
				[4] = { i = -1,   j = 0  }
			},
			equal = {
				[1] = { i = 0,    j = 0  },
				[2] = { i = 1,    j = -1 },
				[3] = { i = -1,   j = -1 },
				[4] = { i = -1,   j = 0  }
			},
			more = {
				[1] = { i = 0,    j = 0  },
				[2] = { i = 1,    j = -1 },
				[3] = { i = -1,   j = 0  },
				[4] = { i = -1,   j = 1  }
			}
		}
	},
	[16] = {
		width = 3,
		height = 2,
		blocks = {
			[1] = { x = 1,       y = 1 },		--            2 1 3
			[2] = { x = 0,       y = 1 },		-- 		      口口口
			[3] = { x = 2,       y = 1 },		--               口4
			[4] = { x = 1.5,     y = 0 }
		},
		cells = {
			less = {
				[1] = { i = 0,    j = 0  },
				[2] = { i = 0,    j = -1 },
				[3] = { i = 0,    j = 1  },
				[4] = { i = -1,   j = 0  }
			},
			equal = {
				[1] = { i = 0,    j = 0  },
				[2] = { i = 0,    j = -1 },
				[3] = { i = 0,    j = 1  },
				[4] = { i = -1,   j = 0  }
			},
			more = {
				[1] = { i = 0,    j = 0  },
				[2] = { i = 0,    j = -1 },
				[3] = { i = 0,    j = 1  },
				[4] = { i = -1,   j = 1  }
			}
		}
	},
	[17] = {
		width = 3,
		height = 2,
		blocks = {
			[1] = { x = 1,       y = 0 },		--             口4
			[2] = { x = 0,       y = 0 },		-- 		      口口口
			[3] = { x = 2,       y = 0 },		--            2  1 3
			[4] = { x = 0.5,     y = 1 }
		},
		cells = {
			less = {
				[1] = { i = 0,    j = 0  },
				[2] = { i = 0,    j = -1 },
				[3] = { i = 0,    j = 1  },
				[4] = { i = 1,    j = 0  }
			},
			equal = {
				[1] = { i = 0,    j = 0  },
				[2] = { i = 0,    j = -1 },
				[3] = { i = 0,    j = 1  },
				[4] = { i = 1,    j = -1 }
			},
			more = {
				[1] = { i = 0,    j = 0  },
				[2] = { i = 0,    j = -1 },
				[3] = { i = 0,    j = 1  },
				[4] = { i = 1,    j = -1 }
			}
		}
	},
	[18] = {
		width = 3,
		height = 2,
		blocks = {
			[1] = { x = 1,       y = 1 },		--            2  1 3
			[2] = { x = 0,       y = 1 },		-- 		      口口口
			[3] = { x = 2,       y = 1 },		--             口4
			[4] = { x = 0.5,     y = 0 }
		},
		cells = {
			less = {
				[1] = { i = 0,    j = 0  },
				[2] = { i = 0,    j = -1 },
				[3] = { i = 0,    j = 1  },
				[4] = { i = -1,   j = -1 }
			},
			equal = {
				[1] = { i = 0,    j = 0  },
				[2] = { i = 0,    j = -1 },
				[3] = { i = 0,    j = 1  },
				[4] = { i = -1,   j = -1 }
			},
			more = {
				[1] = { i = 0,    j = 0  },
				[2] = { i = 0,    j = -1 },
				[3] = { i = 0,    j = 1  },
				[4] = { i = -1,   j = 0  }
			}
		}
	},
	[19] = {
		width = 3,
		height = 2,
		blocks = {
			[1] = { x = 1,       y = 0 },		--               口4
			[2] = { x = 0,       y = 0 },		-- 		      口口口
			[3] = { x = 2,       y = 0 },		--            2  1 3
			[4] = { x = 1.5,     y = 1 }
		},
		cells = {
			less = {
				[1] = { i = 0,    j = 0  },
				[2] = { i = 0,    j = -1 },
				[3] = { i = 0,    j = 1  },
				[4] = { i = 1,    j = 1 }
			},
			equal = {
				[1] = { i = 0,    j = 0  },
				[2] = { i = 0,    j = -1 },
				[3] = { i = 0,    j = 1  },
				[4] = { i = 1,    j = 0 }
			},
			more = {
				[1] = { i = 0,    j = 0  },
				[2] = { i = 0,    j = -1 },
				[3] = { i = 0,    j = 1  },
				[4] = { i = 1,    j = 0  }
			}
		}
	}
}








local eli_advanced_image_path_n = {
	[1] = "image/game/advanced/big_blue_n.png",
    [2] = "image/game/advanced/big_green_n.png",
    [3] = "image/game/advanced/big_orange_n.png",
    [4] = "image/game/advanced/big_purple_n.png",
    [5] = "image/game/advanced/big_red_n.png",
    [6] = "image/game/advanced/big_yellow_n.png"
}

local eli_advanced_image_path_h = {
	[1] = "image/game/advanced/big_blue_h.png",
    [2] = "image/game/advanced/big_green_h.png",
    [3] = "image/game/advanced/big_orange_h.png",
    [4] = "image/game/advanced/big_purple_h.png",
    [5] = "image/game/advanced/big_red_h.png",
    [6] = "image/game/advanced/big_yellow_h.png"
}







rawset(_G,"eli_advanced_config",eli_advanced_config)
rawset(_G,"eli_advanced_image_path_n",eli_advanced_image_path_n)
rawset(_G,"eli_advanced_image_path_h",eli_advanced_image_path_h)